Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ2051CA80208.atdf
        <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1a0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x44020000"/>
            <signals>
            </signals>
            <parameters>
              <param name="ADDVREG_NUM" value="3" caption="Number of additional capless regulators for USB, PLL, ..."/>
              <param name="ADDVREG_PLL_NUM" value="1" caption="Number of additional capless regulators dedicated to PLL(s) (between 0 and ADDVREG_NUM)"/>
              <param name="ADDVREG_PLL_START_INDEX" value="2" caption="Index of the first additional capless regulator dedicated to a PLL within [ADDVREG_NUM-1:0] range. Must be equal to 1 if ADDVREG_PLL_NUM=0."/>
              <param name="BKOUT_NUM" value="2" caption="Number of BKOUT output pin"/>
              <param name="BORVDDUSB_NUM" value="2" caption="Number of BOR_USB"/>
              <param name="CHRG_PUMP_NUM" value="3" caption="Number of Charge Pump"/>
              <param name="IOB_IMPLEMENTED" value="0" caption="one if IOB feature is implemented"/>
              <param name="USER_LDO_IMPLEMENTED" value="0" caption="one if USER_LDO feature is implemented"/>
              <param name="VBAT_IMPLEMENTED" value="0" caption="one if VBAT feature (battery backup feature) is implemented."/>
              <param name="VREGSW_NUM" value="4" caption="Number of main voltage regulator (100mA). Example: 1 for Unicorn, 4 for Riverside."/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for SUPC"/>
              <param name="MCLK_ID_APB" value="7" caption="Index for SUPC APB clock"/>
              <param name="PAC_ID" value="4" caption="Index for SUPC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="4b0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x45010000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC00"/>
              <signal group="WO" index="1" function="F" pad="PC01"/>
              <signal group="WO" index="2" function="F" pad="PC02"/>
              <signal group="WO" index="3" function="F" pad="PC03"/>
              <signal group="WO" index="4" function="F" pad="PC04"/>
              <signal group="WO" index="5" function="F" pad="PC05"/>
              <signal group="WO" index="6" function="F" pad="PC06"/>
              <signal group="WO" index="7" function="F" pad="PC07"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="8" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="26" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="27" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="28" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="29" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="30" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="31" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_MC_6" value="32" caption="Indexes of DMA Match/Compare triggers 6"/>
              <param name="DMAC_ID_MC_7" value="33" caption="Indexes of DMA Match/Compare triggers 7"/>
              <param name="DMAC_ID_OVF" value="25" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for TCC0"/>
              <param name="MCLK_ID_APB" value="41" caption="Index for TCC0 APB clock"/>
              <param name="PAC_ID" value="33" caption="Index for TCC0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x45012000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB10"/>
              <signal group="WO" index="1" function="F" pad="PB11"/>
              <signal group="WO" index="2" function="F" pad="PB12"/>
              <signal group="WO" index="3" function="F" pad="PB13"/>
              <signal group="WO" index="4" function="F" pad="PB14"/>
              <signal group="WO" index="5" function="F" pad="PB15"/>
              <signal group="WO" index="6" function="F" pad="PB16"/>
              <signal group="WO" index="7" function="F" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="8" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="35" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="36" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="37" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="38" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="39" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="40" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_MC_6" value="41" caption="Indexes of DMA Match/Compare triggers 6"/>
              <param name="DMAC_ID_MC_7" value="42" caption="Indexes of DMA Match/Compare triggers 7"/>
              <param name="DMAC_ID_OVF" value="34" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="32" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for TCC1"/>
              <param name="MCLK_ID_APB" value="42" caption="Index for TCC1 APB clock"/>
              <param name="PAC_ID" value="34" caption="Index for TCC1 registers write protection"/>
            </parameters>
          </instance>
