Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ2051CA80208.atdf
        <register name="TPR" offset="0xE40" rw="RW" size="4" access-size="4" caption="ITM Trace Privilege Register">
          <bitfield name="PRIVMASK" caption="" mask="0xF"/>
        </register>
        <register name="TCR" offset="0xE80" rw="RW" size="4" access-size="4" caption="ITM Trace Control Register">
          <bitfield name="ITMENA" caption="" mask="0x1"/>
          <bitfield name="TSENA" caption="" mask="0x2"/>
          <bitfield name="SYNCENA" caption="" mask="0x4"/>
          <bitfield name="DWTENA" caption="" mask="0x8"/>
          <bitfield name="SWOENA" caption="" mask="0x10"/>
          <bitfield name="STALLENA" caption="" mask="0x20"/>
          <bitfield name="TSPrescale" caption="" mask="0x300"/>
          <bitfield name="GTSFREQ" caption="" mask="0xC00"/>
          <bitfield name="TraceBusID" caption="" mask="0x7F0000"/>
          <bitfield name="BUSY" caption="" mask="0x800000"/>
        </register>
        <register name="IWR" offset="0xEF8" rw="W" size="4" access-size="4" caption="ITM Integration Write Register">
          <bitfield name="ATVALIDM" caption="" mask="0x1"/>
        </register>
        <register name="IRR" offset="0xEFC" rw="R" size="4" access-size="4" caption="ITM Integration Read Register">
          <bitfield name="ATREADYM" caption="" mask="0x1"/>
        </register>
      </register-group>
    </module>
    <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000001" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CLKDIV" offset="0xC" rw="RW" size="4" count="2" initval="0x00000000" caption="Clock Divider Control">
          <bitfield name="DIV" caption="Clock Domain Division Factor" mask="0xFF" values="CLKDIV__DIV"/>
        </register>
        <register name="CLKMSK" offset="0x3C" rw="RW" size="4" count="9" initval="0x00000000" caption="Peripheral Clock Enable Mask">
          <bitfield name="MASK" caption="Peripheral Clock Enable Mask" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CLKDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MCRAMC" id="03727" name2="drm_mcramc_v3" version="3b0" caption="Multi-Channel RAM Controller">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller">
        <register name="MCRAMC_CTRLA" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="MCRAMC_CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="MCRAMC_CTRLA__ENABLE"/>
        </register>
        <register name="MCRAMC_SYNCBUSY" offset="0x4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Sync Busy Register">
          <bitfield name="SWRST" caption="Software reset busy bit" mask="0x1"/>
          <bitfield name="FLTEN" caption="Fault Injection Enabled busy bit" mask="0x2"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable busy bit" mask="0x4"/>
        </register>
        <register name="MCRAMC_INTENCLR" offset="0x8" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2"/>
        </register>
        <register name="MCRAMC_INTENSET" offset="0xC" rw="RW" size="4" access-size="4" atomic-op="set:MCRAMC_INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2"/>
        </register>
        <register name="MCRAMC_INTSTA" offset="0x10" rw="RW" size="4" access-size="4" atomic-op="clear:MCRAMC_INTSTA" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SERR" caption="Single Bit Error" mask="0x1"/>
          <bitfield name="DERR" caption="Double Bit Error" mask="0x2"/>
        </register>
        <register name="MCRAMC_FLTCTRL" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Control Register">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="MCRAMC_FLTCTRL__FLTEN"/>
          <bitfield name="FLTMD" caption="Fault Injection Mode" mask="0x3000"/>
        </register>
        <register name="MCRAMC_FLTPTR" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Pointer Register">
          <bitfield name="FLT1PTR" caption="Single Fault Injection Bit Pointer" mask="0xFF"/>
          <bitfield name="FLT2PTR" caption="Double Fault Injection Bit Pointer" mask="0xFF0000"/>
        </register>
        <register name="MCRAMC_FLTADR" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Address Register">
          <bitfield name="FLTADR" caption="Fault Address Offset" mask="0xFFFFFF"/>
        </register>
        <register name="MCRAMC_ERRCADR" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Address Register">
          <bitfield name="ERCADR" caption="ECC SECDED Error Capture Address" mask="0xFFFFFF"/>
        </register>
        <register name="MCRAMC_ERRCPAR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Parity Register">
          <bitfield name="ERCPAR" caption="ECC SECDED Error Capture Parity" mask="0xFF"/>
        </register>
        <register name="MCRAMC_ERRCSYN" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Syndrome Register">
          <bitfield name="ERCSYN" caption="ECC SECDED Error Capture Syndrome" mask="0xFF" values="MCRAMC_ERRCSYN__ERCSYN"/>
          <bitfield name="ERR1" caption="ECC Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="ECC Double Bit Error" mask="0x8000" values="MCRAMC_ERRCSYN__ERR2"/>
        </register>
      </register-group>
